src/InformationRegisters/ЖурналЛогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ЖурналЛогов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполненоУспешно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыГрупповойОбработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЖурналЛогов/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
//
//
Процедура СписокПриАктивизацииСтроки(Элемент)
	Попытка
		Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
			СообщениеБыстрыйВывод = Элемент.ТекущиеДанные.Сообщение;
		КонецЕсли;
	Исключение
		СообщениеБыстрыйВывод = "";
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
//
//
Процедура СократитьЖурнал(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();	
	Диалог.Период = Новый СтандартныйПериод;
	Если Диалог.Редактировать() Тогда 
    	СократитьЖурналНаСервере(Диалог.Период);
		ЭтаФорма.ОбновитьОтображениеДанных();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
//
//
Процедура СократитьЖурналНаСервере(ВыбранныйПериод)
	
	ДатаНачала = ВыбранныйПериод.ДатаНачала;
	ДатаОкончания = ?(ЗначениеЗаполнено(ВыбранныйПериод.ДатаОкончания), ВыбранныйПериод.ДатаОкончания, ДобавитьМесяц(ТекущаяДатаСеанса(), 100));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЖурналЛогов.ДатаСобытия,
		|	ЖурналЛогов.ИнформационнаяБаза,
		|	ЖурналЛогов.ВидОбработки,
		|	ЖурналЛогов.ВыполненоУспешно,
		|	ЖурналЛогов.Сообщение
		|ИЗ
		|	РегистрСведений.ЖурналЛогов КАК ЖурналЛогов
		|ГДЕ
		|	НЕ(ЖурналЛогов.ДатаСобытия МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|
		|ДЛЯ ИЗМЕНЕНИЯ";

	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	
	НаборЗаписей = РегистрыСведений.ЖурналЛогов.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	НаборЗаписей.Записать();
		
КонецПроцедуры
